aethaniel/ExperimentalCore-sam/boards.txt
# Copyright (c) 2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

<variant>.name=Variant name
<variant>.vid.0=<usb vendor id>
<variant>.pid.0=<usb product id>
<variant>.upload.tool=openocd
<variant>.upload.protocol=sam-ba
<variant>.upload.maximum_size=<maximum allocated flash size>
<variant>.upload.use_1200bps_touch=false
<variant>.upload.wait_for_upload_port=false
<variant>.upload.native_usb=false
<variant>.build.mcu=<variant core (GCC)
<variant>.build.f_cpu=<cpu frequency>
<variant>.build.usb_product="<USB Product name>"
<variant>.build.usb_manufacturer="<USB Vendor name>"
<variant>.build.board=<VARIANT_LABEL>
<variant>.build.core=arduino
<variant>.build.extra_flags=-D<DEVICE_ID> {build.usb_flags}
<variant>.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
<variant>.build.openocdscript=openocd_scripts/variant.cfg
<variant>.build.variant=<variant folder name>
<variant>.build.variant_system_lib=
<variant>.build.vid=<variant bootloader USB vendor ID>
<variant>.build.pid=<variant bootloader USB product ID>
<variant>.bootloader.tool=openocd
<variant>.bootloader.file=<bootloader binary path relative to bootloaders folder>

